english.org
#+title: English Study

* 发音
** 元音字母和辅音字母
在英文的26个字母中，有5个元音字母，分别为 =a=, =e=, =i=, =o=, =u=; 剩下的21个字母为辅音字母。
** 开音节和闭音节
- 开音节单词: 以元音字母结尾的单词
- 闭音节单词: 以辅音字母结尾的单词

通常，辅音字母的发音较单一，而元音字母的发音相对复杂。元音字母的发音有长音(也即字母本身的音)和短音，通常在开音节单词中发长音，在闭音节单词中发短音。
| 元音字母 | =a=    | =e=    | =i=    | =o=    | =u=     |
|----------+--------+--------+--------+--------+---------|
| 开音节   | =[ei]= | =[i:]= | =[ai]= | =[əʊ]= | =[ju:]= |
| 闭音节   | =[æ]=  | =[e]=  | =[ɪ]=  | =[ɒ]=  | =[ʌ]=   |
** 音标
- 爆破音: =[p]=, =[b]=, =[t]=, =[d]=, =[k]=, =[g]=.
** Misc.
- I can't do it 中的 ='t= 不发音，所以这句话读起来和I can do it相似，区别仅仅在于后者中的can弱读。
- 字母组合 =ee= 和 =ea= 均发 =[i:]= 音。不同在于， =ee= 喜欢和字母 =b= 和字母 =p= 在一起；而 =ea= 喜欢和字母 =d= 和字母 =t= 在一起。
- 字母组合 =ai= 和 =ay= 均发 =[ei]= 音。不同在于， =ai= 一般位于单词中间；而 =ay= 位于单词尾部。
* 单词
- appointment: 预约
- beverage: 饮料
- classy: 优等的, 上等的, 有品味的.
- disrupt：使瓦解
- mind
  + in one's mind: 表达某人记得某事，在某人的记忆里。
  + on one's mind: 表达困扰某人的问题或事情，某人心里挂念担心的问题或事情。
- pantsuit：衣裤套装
- sale: 促销
- stereotype：模式化形象，刻板印象。
- stingy: 吝啬的, 小气的.
- trendy: 流行的，时髦的，时尚的。
- 变化
  + get: 逐渐变
  + turn: 颜色变
  + grow: 成长变
  + become: 身份变
- 看
  + look: 看的时间短
  + watch: 看的时间长
  + see: 强调看的结果
  + read: 强调安静读
- 意识
  + conscious/consciously: 有意识的/有意识地
  + subconscious/subconsciously: 潜意识的/潜意识地
- 真
  + very: 只能修饰形容词或副词。
  + really: 能修饰动词、形容词、或副词。
- 动物
  + mosquito: 蚊子
- 超市
  + 查看促销活动: check promotions
  + 自动扶梯: escalator
    - 乘坐扶梯: take the escalator
  + 蔬菜
    - 香菜: coriander
    - 麻薯: mochi
  + 水果
    - 榴莲: durian
  + 瑞士卷: Swiss roll
- 盖子
  + cap: 通常指紧密贴合的盖子，需要拧上或者扣上才能固定。一般用于瓶子、小容器、笔、牙膏等。
    - 打开: unscrew the cap, twist off the cap.
    - 关上: screw the cap, tighten the cap.
  + lid: 通常是可以拿起来的盖子，盖在容器顶部。一般用于锅、盒子、罐子、垃圾桶等较大的容器。例如：垃圾桶盖子: trash can lid.
    - 打开/关上盖子: open/close the lid
- 租房
  + 合同: contract
  + 房东: landlord
  + 押金: deposit
  + 中介: broker
  + 转租: sublet
  + 租户: tenant
  + 水电费: utilities
  + 设施: amenities
  + 租金: rent
  + 带家具的: furnished
  + 租期: tenancy period
* 短语
- Another time: 下次见
- As time goes by: 时光流逝
- As you wish: 如你所愿
- Believe it or not: 信不信由你
- be made
  + of: 看得见原材料
  + from: 看不见原材料
- catch one's drift: 理解某人所说的话的大概意思
- charge by the hour: 按小时收费
- cut in line: 插队
- in a rush: 赶时间
- a big deal: 重要的事
- make ... complicated: 使 ... 复杂化
- head back: 返回
- Did it ever occur to you that ...?: 你有没有想过...?
- Dig in: 开吃吧
- Same here: 我也一样
- What's up?: 最近怎么样?
- Don't be so hard on yourself: 别对自己太苛刻
- Don't come for me: 别找我麻烦
- Don't fall for it: 别上当
- Don't fuck with me: 别耍我
- Don't give me that look: 别那样看我
- Don't lose your head: 别失去理智了
- 
  + Don't talk the talk if you can't walk the walk: 不要光说不练, 拿出实际行动.
  + Put up or shut up: 要么你上, 要么闭嘴.
  + Easy for you to say: 站着说话不腰疼
  + A promise is a promise: 说到就要做到
- Don't waste my time: 不要浪费我的时间
- double-edged sword: 双刃剑
- face the music: 面对现实
- Fasten your seatbelt: 系好你的安全带
- From the ground up: 从头开始, 从零开始.
- Give it your best shot: 尽你最大的努力
- green light: 批准
- Hard to believe: 难以置信
- Has any one seen sb/sth?: 用于询问某人/某物在哪儿
- Here you go: 给你
- hit the roof: 大发雷霆
- Home free: 大功告成
- How am I supposed to do sth.?: 我怎么能做某事?
- How are things going?: 事情进展如何?
- How's life treating you?: 你过得怎么样?
- How so?: 何出此言?
- How do you sleep at night?: 你的良心不会痛吗?
- Honesty is the best policy: 真诚才是必杀技
- Who do you think you are?: 你以为你是谁? 你算哪根葱?
- You had me at hello: 我对你一见钟情
- First things first: 重要的事情先做
- Wake up and smell the coffee: 醒醒, 认清现实吧.
- Be who you are: 做回你自己
- One step at a time: 一步一步来
- I adore you: 我超喜欢你
- Every dog has his day: 人人都有出头之日
- Break a leg: 祝你成功
- Poppycock: 胡说八道
- You got this: 你一定可以的
- 我更喜欢...而不是...
  + I prefer to ... rather than ...
  + I would rather ... than ...
  + I prefer ... to ...
  + I enjoy ... more than ...
- meet up for ...: 见面...
- Keep an eye on ...: 留意, 照看, 盯着.
- I can't wait to see you: 我等不及想见你
- I'd love/like to hear your throughts on ...: 我想听听您对...的看法
- I don't see why not: 我觉得没什么不可以
- I have faith in you: 我对你有信心
- I'll have what he's having: 我要和他一样的
- I'm afraid not: 恐怕不行
- I'm not in the mood: 我没心情, 我没兴致.
- I'm so sorry for running late: 非常抱歉迟到了
- I'm truly sorry: 我真的很抱歉
- I need a favor: 我需要帮忙
- Could I trouble you for a favor?: 能麻烦您帮个忙吗?
- I saw this coming: 我料到会是这样
- I should've done sth.: 我本该做某事的
- It drives me crazy: 简直快让我疯了
- It is not that bad: 不至于
- It's a long story: 说来话长
- It's as simple as that: 就这么简单
- It's no good/use doing sth: 做某事不好/没用
- It's waste doing: 做某事真浪费
- It was all for nothing: 一切都白费了, 白忙一场, 徒劳无功.
- I will fix you up: 我会帮你搞定
- (just) keep in mind that ...: 记住 ...
- Keep me posted: 有情况通知我
- Let me get this straight: 让我理清楚
- Let me walk you to the door: 我送您到门口
- Let's be frank: 让我们坦诚相待, 我们不要拐弯抹角了.
- Let's get out of here: 我们离开这里
- Let's see you do better: 让我们看看你是否能够技高一筹.
- Let sleeping dogs lie: 别惹麻烦, 别多事.
- Long time no see: 好久不见
- Make a fresh start: 重新开始
- Make every moment count: 珍惜每一刻
- My hands are tied: 我束手无策, 我无能为力.
- Nip(掐) it in the bud(芽): 防范于未然, 消灭于萌芽状态.
- Nothing ventured, nothing gained.: 不入虎穴焉得虎子.
- Now is not the time: 现在不是时候
- obtain forgiveness: 争取谅解
- Once bitten, twice shy: 一朝被蛇咬, 十年怕井绳.
- on short notice: 短时间内(紧急情况下)
- out of sight, out of mind: 眼不见, 心不烦.
- over my dead body: 想都别想
- rob the cradle: 老牛吃嫩草
- rush for success: 急于求成
- sb. is totally winning life: 某人绝对是人生赢家
- sedate sb: 通过药物使某人镇静
- show up: 出现
- someone thought it would be ...: 某人以为会...
- split the bill: AA制
- Stop making noise: 别吵了
- That's just the way it is: 就是这样
- They broke up: 他们分手了
- Up yours: 去你的吧
- What's it to you?: 关你什么事?
- What's keeping you busy these days?: 你最近在忙什么?
- This gift is just a small token of appreciation: 这份礼物聊表心意
- What's the hurry?: 急什么?
- What's the point?: 重点是什么?
- What the hell?: 搞什么鬼?
- withdraw money: (从银行)取钱
- wrap one's head/mind around: 想明白
- You are a chicken: 你是胆小鬼
- You can keep the charge: 不用找了
- You can say that again: 确实, 表示强烈赞同, 同exactly.
- You can't keep doing this: 你不能总是这样
- You look dashing: 你帅呆了
- You look stunning: 你美呆了
- You look divine: 你看起来气质非凡
- You're a phony: 你是个骗子
- You're the boss: 你说了算
- You're so mean: 你太过分了
- I can handle myself: 我能照顾好自己
- You've got to be kidding me: 你肯定在逗我
- I've heard so much about you: 久仰大名
- I like being around you: 我喜欢和你在一起
- I don't feel like going to work: 我不想上班.
- Another day, another dollar.: 当一天和尚, 撞一天钟.
- Old habits die hard: 江山易改本性难移
- move to a quieter spot: 换个安静的地方
- You must try the signature dish here: 你一定要尝尝这里的招牌菜
- 喝咖啡
  + short: 小杯
  + tall: 中杯
  + granda: 大杯
  + venti: 超大杯
  + trenta: 巨杯
- 天生不是作...的料
  + not cut out to be a/an ...
  + not cut out for ...
- 我先走了
  + I am heading out now
  + I have to leave/go now
- 关于吃饭
  + We can eat at home: 我们可以在家吃
  + We can eat out: 我们可以出去吃
  + We can cook: 我们可以自己做
  + We can order takeout: 我们可以点外卖
  + We can eat less: 我们可以少吃一点
- Well, this is me. 我到了
- 我在现场
  + I'm on site
  + I'm at the location
- 不用谢/不客气
  + No thanks needed.
  + No need to thank me.
  + Don't mention it.
  + Oh it's nothing.
  + (It's) my pleasure.
  + That's OK.
  + Not at all.
  + That's all right.
- 旅行
  + 身份证: ID card
  + 行李: luggage
  + 航站楼: terminal
  + 值机: check-in
  + 进站: arrival
  + 出站: departure
  + 登机口: boarding gate
  + 靠窗座: window-seat
  + 靠过道座: aisle-seat
  + 小推车: trolley
- 骂人
  + moron: 蠢货
  + idiot: 白痴
  + toxic: 有毒的
  + arrogant: 自大狂
  + hypocrite: 伪君子
  + nasty: 讨厌鬼
  + lazy: 懒虫
  + rude: 粗鲁的
  + selfish: 自私鬼
  + bully: 恶霸
  + snob: 势利眼
  + coward: 懦夫
  + liar: 骗子
  + jerk: 混蛋
- in 用于较长的时间，如: in 年/月/季节/上午/下午/晚上
- 量词
  + a slice/loaf of bread: 一片/条面包
  + a box of eggs: 一盒鸡蛋
  + a head of broccoli: 一颗西兰花
  + a bar of chocolate: 一条巧克力
  + a packet of crisps: 一包薯片
  + a tin of beans: 一罐豆子
  + a jar of jam: 一罐果酱
  + a tube of toothpaste: 一管牙膏
  + a bar of soap: 一块肥皂
  + a box of tissues: 一盒纸巾
